{ inputs, lib, pkgs, ... }: with lib; let
  series = f: from: to: listToAttrs (zipListsWith nameValuePair (map f from) to);
  digitChars = stringToCharacters "0123456789";

  compose.keysyms = {
    "⋆" = "Multi_key";
    "‸" = "dead_circumflex";
    "µ" = "dead_greek";
    "→" = "Right";
    "←" = "Left";
    "↑" = "Up";
    "↓" = "Down";
    "⇥" = "Tab";
    "↵" = "Return";
  };

  compose.entries =
    series (x: "⋆C${x}") upperChars [ "𝒜" "ℬ" "𝒞" "𝒟" "ℰ" "ℱ" "𝒢" "ℋ" "ℐ" "𝒥" "𝒦" "ℒ" "ℳ" "𝒩" "𝒪" "𝒫" "𝒬" "ℛ" "𝒮" "𝒯" "𝒰" "𝒱" "𝒲" "𝒳" "𝒴" "𝒵" ] //
    series (x: "⋆B${x}") upperChars [ "𝔸" "𝔹" "ℂ" "𝔻" "𝔼" "𝔽" "𝔾" "ℍ" "𝕀" "𝕁" "𝕂" "𝕃" "𝕄" "ℕ" "𝕆" "ℙ" "ℚ" "ℝ" "𝕊" "𝕋" "𝕌" "𝕍" "𝕎" "𝕏" "𝕐" "ℤ" ] //
    series (x: "⋆B${x}") lowerChars [ "𝕒" "𝕓" "𝕔" "𝕕" "𝕖" "𝕗" "𝕘" "𝕙" "𝕚" "𝕛" "𝕜" "𝕝" "𝕞" "𝕟" "𝕠" "𝕡" "𝕢" "𝕣" "𝕤" "𝕥" "𝕦" "𝕧" "𝕨" "𝕩" "𝕪" "𝕫" ] //
    series (x: "⋆B${x}") digitChars [ "𝟘" "𝟙" "𝟚" "𝟛" "𝟜" "𝟝" "𝟞" "𝟟" "𝟠" "𝟡" ] //
    series (x: "⋆b${x}") upperChars [ "𝐀" "𝐁" "𝐂" "𝐃" "𝐄" "𝐅" "𝐆" "𝐇" "𝐈" "𝐉" "𝐊" "𝐋" "𝐌" "𝐍" "𝐎" "𝐏" "𝐐" "𝐑" "𝐒" "𝐓" "𝐔" "𝐕" "𝐖" "𝐗" "𝐘" "𝐙" ] //
    series (x: "⋆b${x}") lowerChars [ "𝐚" "𝐛" "𝐜" "𝐝" "𝐞" "𝐟" "𝐠" "𝐡" "𝐢" "𝐣" "𝐤" "𝐥" "𝐦" "𝐧" "𝐨" "𝐩" "𝐪" "𝐫" "𝐬" "𝐭" "𝐮" "𝐯" "𝐰" "𝐱" "𝐲" "𝐳" ] //
    series (x: "⋆b${x}") digitChars [ "𝟎" "𝟏" "𝟐" "𝟑" "𝟒" "𝟓" "𝟔" "𝟕" "𝟖" "𝟗" ] //
    series (x: "⋆f${x}") upperChars [ "𝔄" "𝔅" "ℭ" "𝔇" "𝔈" "𝔉" "𝔊" "ℌ" "ℑ" "𝔍" "𝔎" "𝔏" "𝔐" "𝔑" "𝔒" "𝔓" "𝔔" "ℜ" "𝔖" "𝔗" "𝔘" "𝔙" "𝔚" "𝔛" "𝔜" "ℨ" ] //
    series (x: "⋆f${x}") lowerChars [ "𝔞" "𝔟" "𝔠" "𝔡" "𝔢" "𝔣" "𝔤" "𝔥" "𝔦" "𝔧" "𝔨" "𝔩" "𝔪" "𝔫" "𝔬" "𝔭" "𝔮" "𝔯" "𝔰" "𝔱" "𝔲" "𝔳" "𝔴" "𝔵" "𝔶" "𝔷" ] //
    series (x: "⋆F${x}") upperChars [ "𝕬" "𝕭" "𝕮" "𝕯" "𝕰" "𝕱" "𝕲" "𝕳" "𝕴" "𝕵" "𝕶" "𝕷" "𝕸" "𝕹" "𝕺" "𝕻" "𝕼" "𝕽" "𝕾" "𝕿" "𝖀" "𝖁" "𝖂" "𝖃" "𝖄" "𝖅" ] //
    series (x: "⋆F${x}") lowerChars [ "𝖆" "𝖇" "𝖈" "𝖉" "𝖊" "𝖋" "𝖌" "𝖍" "𝖎" "𝖏" "𝖐" "𝖑" "𝖒" "𝖓" "𝖔" "𝖕" "𝖖" "𝖗" "𝖘" "𝖙" "𝖚" "𝖛" "𝖜" "𝖝" "𝖞" "𝖟" ] //
    series (x: "⋆_${x}") (stringToCharacters "acehijklmnoprstuvx") [ "ₐ" "𞁞" "ₑ" "ₕ" "ᵢ" "ⱼ" "ₖ" "ₗ" "ₘ" "ₙ" "ₒ" "ₚ" "ᵣ" "ₛ" "ₜ" "ᵤ" "ᵥ" "ₓ" ] //
  {
    "⋆en" = "–";
    "⋆<|s" = "◂";
    "⋆|>s" = "▸";
    "⋆|>w" = "▹";
    "⋆<|b" = "◀";
    "⋆|>b" = "▶";
    "⋆box" = "□";
    "⋆|→" = "↦";
    "⋆qed" = "∎";
    "⋆oo" = "∘";
    "⋆**" = "⋆";
    "⋆ast" = "∗";
    "⋆*." = "∙";
    "⋆*," = "·";
    "⋆*o" = "∘";
    "⋆<*>" = "⊛";
    "⋆×|" = "⋊";
    "⋆x|" = "⋊";
    "⋆|×" = "⋉";
    "⋆|x" = "⋉";
    "⋆wr" = "≀";
    "⋆:=" = "≔";
    "⋆==" = "≡";
    "⋆=3" = "≡";
    "⋆=/=" = "≢";
    "⋆=/3" = "≢";
    "⋆=4" = "≣";
    "⋆~=" = "≃";
    "⋆=~" = "≅";
    "⋆~~" = "≈";
    "⋆?=" = "≟";
    "⋆.=" = "≐";
    "⋆=." = "≐";
    "⋆<(" = "⟨";
    "⋆>)" = "⟩";
    "⋆(<" = "⟨";
    "⋆)>" = "⟩";
    "⋆(|" = "⦇";
    "⋆|)" = "⦈";
    "⋆[|" = "⟦";
    "⋆|]" = "⟧";
    "⋆{|" = "⦃";
    "⋆|}" = "⦄";
    "⋆_[" = "⌞";
    "⋆[_" = "⌞";
    "⋆_]" = "⌟";
    "⋆]_" = "⌟";
    "⋆()" = "≬";
    "⋆<<" = "≪";
    "⋆>>" = "≫";
    "⋆mid" = "∣";
    "⋆||" = "∥";
    "⋆/\\" = "∧";
    "⋆land" = "∧";
    "⋆lor" = "∨";
    "⋆iff" = "⇔";
    "⋆top" = "⊤";
    "⋆bot" = "⊥";
    "⋆_|_" = "⊥";
    "⋆ex" = "∃";
    "⋆/ex" = "∄";
    "⋆all" = "∀";
    "⋆|-" = "⊢";
    "⋆2|-" = "⊩";
    "⋆-|" = "⊣";
    "⋆|=" = "⊨";
    "⋆mem" = "∈";
    "⋆nmem" = "∉";
    "⋆inc" = "⊂";
    "⋆cni" = "⊃";
    "⋆ninc" = "⊄";
    "⋆/inc" = "⊄";
    "⋆=inc" = "⊆";
    "⋆=cni" = "⊇";
    "⋆cup" = "∪";
    "⋆cap" = "∩";
    "⋆sqcup" = "⊔";
    "⋆sqcap" = "⊓";
    "⋆u+" = "⊎";
    "⋆U+" = "⊎";
    "⋆/0" = "∅";
    "⋆inf" = "∞";
    "⋆aleph" = "ℵ";
    "⋆alef" = "ℵ";
    "⋆o*" = "⊗";
    "⋆o+" = "⊕";
    "⋆o." = "⊙";
    "⋆&&" = "⅋";
    "⋆par" = "⅋";
    "⋆-o" = "⊸";
    "⋆sqrt" = "√";
    "⋆3sq" = "∛";
    "⋆4sq" = "∜";
    "⋆int" = "∫";
    "⋆1/4" = "¼";
    "⋆1/2" = "½";
    "⋆3/4" = "¾";
    "⋆1/3" = "⅓";
    "⋆2/3" = "⅔";
    "⋆1/5" = "⅕";
    "⋆2/5" = "⅖";
    "⋆3/5" = "⅗";
    "⋆4/5" = "⅘";
    "⋆1/6" = "⅙";
    "⋆5/6" = "⅚";
    "⋆1/8" = "⅛";
    "⋆3/8" = "⅜";
    "⋆5/8" = "⅝";
    "⋆7/8" = "⅞";
    "µ/l" = "ƛ";
    "⋆^a" = "ᵃ";
    "⋆^A" = "ᴬ";
    "‸b" = "ᵇ";
    "‸B" = "ᴮ";
    "‸c" = "ᶜ";
    "‸C" = "ꟲ";
    "‸d" = "ᵈ";
    "‸D" = "ᴰ";
    "⋆^e" = "ᵉ";
    "⋆^E" = "ᴱ";
    "‸f" = "ᶠ";
    "‸F" = "ꟳ";
    "‸g" = "ᵍ";
    "‸G" = "ᴳ";
    "‸h" = "ʰ";
    "‸H" = "ᴴ";
    "⋆^i" = "ⁱ";
    "⋆^I" = "ᴵ";
    "⋆^j" = "ʲ";
    "⋆^J" = "ᴶ";
    "‸k" = "ᵏ";
    "‸K" = "ᴷ";
    "‸l" = "ˡ";
    "‸L" = "ᴸ";
    "‸m" = "ᵐ";
    "‸M" = "ᴹ";
    "‸n" = "ⁿ";
    "‸N" = "ᴺ";
    "⋆^o" = "ᵒ";
    "⋆^O" = "ᴼ";
    "‸p" = "ᵖ";
    "‸P" = "ᴾ";
    "‸q" = "𐞥";
    "‸Q" = "ꟴ";
    "‸r" = "ʳ";
    "‸R" = "ᴿ";
    "‸s" = "ˢ";
    "‸t" = "ᵗ";
    "‸T" = "ᵀ";
    "⋆^u" = "ᵘ";
    "⋆^U" = "ᵁ";
    "‸v" = "ᵛ";
    "‸V" = "ⱽ";
    "‸w" = "ʷ";
    "‸W" = "ᵂ";
    "‸x" = "ˣ";
    "⋆^y" = "ʸ";
    "‸z" = "ᶻ";
    "‸'" = "′";
    "‸\"" = "″";
    "⋆b~" = "∼";
    "⋆el" = "ℓ";
    "⋆dee" = "∂";
    "⋆nab" = "∇";
    "⋆yo" = "よ";
    "⋆\"o" = "ő";
    "⋆\"O" = "Ő";
    "⋆  " = "␣";
    "⋆↑" = "↑";
    "⋆↓" = "↓";
    "⋆←" = "←";
    "⋆→" = "→";
    "⋆sw" = "↙";
    "⋆se" = "↘";
    "⋆nw" = "↖";
    "⋆ne" = "↗";
    "⋆lr" = "↔";
    "⋆ud" = "↕";
    "⋆(→" = "↪";
    "⋆-/>" = "↛";
    "⋆</-" = "↚";
    "⋆2←" = "⇇";
    "⋆2→" = "⇉";
    "⋆3→" = "⇶";
    "⋆l→" = "⟶";
    "⋆l←" = "⟵";
    "⋆=↑" = "⇑";
    "⋆l=>" = "⟹";
    "⋆l=<" = "⟸";
    "⋆⇥" = "⇥";
    "⋆↵" = "↵";
    "⋆fl" = "❧";
    "⋆ok" = "✓";
    "⋆nok" = "✗";
    "⋆zap" = "↯";
    "⋆1." = "⒈";
    "⋆2." = "⒉";
    "⋆3." = "⒊";
    "⋆4." = "⒋";
    "⋆5." = "⒌";
    "⋆6." = "⒍";
    "⋆7." = "⒎";
    "⋆8." = "⒏";
    "⋆9." = "⒐";
    "⋆10." = "⒑";
    "⋆fll" = "⌊";
    "⋆flr" = "⌋";
    "⋆cel" = "⌈";
    "⋆cer" = "⌉";
    "‸[" = "⌜";
    "‸]" = "⌝";
    "⋆2!" = "‼";
    "⋆2?" = "⁇";
    "⋆zw" = "​";
    "⋆znj" = "";
    "⋆zwj" = "";
    "⋆wj" = "⁠";
    "⋆.|." = "⋮";
    "⋆+|" = "†";
    "⋆++" = "‡";
    "⋆st" = "ﬆ";
    "⋆ft" = "ﬅ";
    "⋆_-" = "₋";
    "⋆::" = "∷";
    "⋆#G" = "𝄞";
    "⋆#F" = "𝄢";
    "⋆#C" = "𝄡";
    "⋆°C" = "℃";
    "⋆°F" = "℉";
    "⋆mu" = "無";
    "⋆om" = "ॐ";
    "⋆et" = "ꝫ";
    "⋆ET" = "Ꝫ";
    "⋆sh" = "ʃ";
    "⋆cube" = "🧊";
    "⋆OO" = "👀";
    "⋆><" = "👉👈";
    "⋆lem" = "https://f.monade.li/lemon.webp";
    "⋆sus" = "ඞ";
    "⋆\\/" = "¯\\_(ツ)_/¯";
    "⋆2\\/" = "┐('~'; )┌";
    "⋆len" = "( ͡° ͜ʖ ͡°)";
    "⋆meh" = "ಠ_ಠ";
    "⋆tf" = "(╯°□°）╯︵ ┻━┻";
    "⋆qt" = "(◕‿◕)";
    "⋆sad" = "(｡•́︿•̀｡)";
    "⋆sry" = "('''' •᷄ ᴗ •᷅ )";
  };

  composeFile = pkgs.runCommand "custom.compose" {
    nativeBuildInputs = [ inputs.agda-compose.packages.x86_64-linux.json2compose ];
  } ''
    json2compose < ${builtins.toFile "compose.json" (builtins.toJSON compose)} > "$out"
  '';
in {
  hm.home.file.".XCompose" = {
    text = ''
      include "%L"
      include "${inputs.agda-compose.packages.x86_64-linux.agda-compose}"
      include "${composeFile}"
    '';

    onChange = ''
      ${getBin pkgs.ibus}/bin/ibus restart || true
    '';
  };
}
